Revit 2026 API

# OpeningBoundaryCurves Property

---

The geometry information for non-rectangular openings in project documents, or for all openings in family documents.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArray BoundaryCurves { get; }
```
```vb
Public ReadOnly Property BoundaryCurves As CurveArray
	Get
```
```cpp
public:
property CurveArray^ BoundaryCurves {
	CurveArray^ get ();
}
```
```fsharp
member BoundaryCurves : CurveArray with get
```

#### Property Value

CurveArray

If IsRectBoundary is true, this value is .

#### Reference

Opening Class

Autodesk.Revit.DB Namespace